Autodesk.Revit.DB.HermiteSurface.IsValid
Checks whether this HermiteSurface object is valid.
Remarks:
An attempt to access or compute data in an invalid Hermite Surface will cause an exception.
Returns:
True if this is a valid Hermite Surface, false otherwise.
Since:
2017

Autodesk.Revit.DB.HermiteSurface.Create(System.Int32,System.Int32,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},System.Boolean,System.Boolean)
Create a Hermite surface using a net of 3D points as input. Specify periodicity in U and V direction.
Remarks:
Points form a net of nU * nV (less one each if periodic) 3D points.
nU:
Number of points in U direction.
nV:
Number of points in V direction.
points:
Array of points. Must contain nU*nV points.
periodicU:
Periodicity in U direction
periodicV:
Periodicity in V direction
Returns:
A Hermite surface object created from input data.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Thrown when the input arguments are inconsistent. The most common case is incorrect number of items in one of the lists.
Since:
2017

Autodesk.Revit.DB.HermiteSurface.Create(System.Int32,System.Int32,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Create a non-periodic Hermite surface using a net of 3D points as input.
Remarks:
Points form a net of nU * nV 3D points. Suitable defaults will be used for other surface parameters.
See other Create() functions if greater control over input is desired.
nU:
Number of points in U direction.
nV:
Number of points in V direction.
points:
Array of points. Must contain nU*nV points.
Returns:
A Hermite surface object created from input data.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Thrown when the input arguments are inconsistent. The most common case is incorrect number of items in one of the lists.
Since:
2017

Autodesk.Revit.DB.HermiteSurface
A Hermite Surface.
Since:
2017